/**
 * รายการข้อหาสำหรับ Blacklist
 */
export const BLACKLIST_CHARGES = [
  'ตำรวจลงพื้นที่ไม่พบเคส (ไม่มีการรายงานตัว หรือมาชำระค่าปรับตามที่เรียก) ภายใน 10 นาที นับจากกดเรียกเคส',
  'ก่อเหตุ / ก่อความไม่สงบ ในพื้นที่สถานีตำรวจ (ทะเลาะ , ด่า , บั๊มรถ , บีบแตรรบกวน หรือก่อความวุ่นวายอื่นๆ)',
  'พูดจาหมิ่นประมาทเจ้าหน้าที่ (Toxic ตามกฎประเทศ)',
  'ทำร้ายร่างกายตำรวจ ยกเว้น ตำรวจที่เข้าเคสอุ้มเอ๋อเท่านั้น',
  'ก่อกวน/ขัดขวางการทำงาน',
  'ทำร้ายร่างกายกันต่อหน้าตำรวจ',
  'บลัฟกันต่อหน้าตำรวจ (กรณีตำรวจเข้ารับเคสในจุดที่มีการทะเลาะวิวาท หรือ เคสสตอรี่นอก รวมถึงมีการตักเตือน และแจ้งแล้ว)',
  'ควัก, ถืออาวุธต่อหน้าตำรวจ',
  'กดเรียกเคสจากในวอโซน แอร์ดรอป หรือกิจกรรมประเทศอื่น ๆ ที่ตำรวจไม่สามารถเข้าไปทำการชุบได้',
  'ขโมยรถหรือฮอตำรวจ',
  'เข้าพื้นที่ส่วนหน่วยงานโดยไม่ได้รับอนุญาตจากตำรวจ (ห้องที่มีการล็อกไม่ให้เข้า / จุดเบิกฮอ / จุดจอดฮอ)',
  'นำ หรือ ขับ พาหนะทุกชนิดเข้ามาภายในสถานีตำรวจ (รวมไปถึง สเก็ตบอร์ด)',
  'ไม่สวมหรือถอดเสื้อผ้า / สวมใส่หน้ากากหรือปิดบังใบหน้าในเขตสถานีตำรวจ',
  'ถ่ายรูปติดหน่วยงานตำรวจ,ยานพาหนะตำรวจ ลงทวิตเตอร์ (เพื่อปลุกปั่นหรือ โพสต์เชิงลบ)',
  'โพสต์บัพหน่วยงานตำรวจ หรือทำให้หน่วยงานและองค์กรเสียหายผ่านทวิตเตอร์',
  'ทะเลาะวิวาท ตี หรือ ปะทะกันในขณะที่มีคูลดาวน์สตอรี่',
  'ใช้พื้นที่สถานีตำรวจเป็นที่พักพิง ขณะมีสตอรี่ (เมื่อครบ 15 นาที และมีการเตือน 1 ครั้ง หากยังไม่ออกจากพื้นที่จะ BLACKLIST ทันที)',
  'หาก Gang หรือ Family ติด BLACKLIST กับทางสถานีตำรวจอยู่ แล้วทำการยุบ Gang หรือ Family',
] as const;

export type BlacklistCharge = typeof BLACKLIST_CHARGES[number];
